//================================================================================================================
// № 8 Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
//================================================================================================================

int firstNumber = 1;
Console.Write("Введите число N: ");
int secondNumber = int.Parse(Console.ReadLine());

for (int i = firstNumber; i <= secondNumber; i++)
{
    if (i % 2 == 0)
    {
        Console.Write(i + " ");
    }
}
Console.ReadKey();